---
type: Stone
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 10
tags: [revit-api, class]
---

# Stone

`Autodesk.Revit.DB.Visual.Stone` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | StoneApplication | 2018.1 | `public static string StoneApplication { get ; }` |
| Property | StoneBump | 2018.1 | `public static string StoneBump { get ; }` |
| Property | StoneBumpAmount | 2018.1 | `public static string StoneBumpAmount { get ; }` |
| Property | StoneBumpMap | 2018.1 | `public static string StoneBumpMap { get ; }` |
| Property | StoneColor | 2018.1 | `public static string StoneColor { get ; }` |
| Property | StonePattern | 2018.1 | `public static string StonePattern { get ; }` |
| Property | StonePatternAmount | 2018.1 | `public static string StonePatternAmount { get ; }` |
| Property | StonePatternMap | 2018.1 | `public static string StonePatternMap { get ; }` |